mdhardenburgh/Blinky/Packages/.cache/NXP.MIMXRT1064_DFP.12.0.0.pdsc
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1064" Cversion="1.0.0" condition="device.MIMXRT1064_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MIMXRT1064_startup_AND_driver.clock_AND_driver.common_AND_driver.igpio_AND_driver.iomuxc_AND_driver.lpuart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.edma">
      <description/>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c" Cversion="2.1.0" condition="device.MIMXRT1064_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/i2c/fsl_codec_i2c.c"/>
        <file category="header" name="components/codec/i2c/fsl_codec_i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/lists/generic_list.c"/>
        <file category="header" name="components/lists/generic_list.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_adapter" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.common_AND_driver.lpi2c">
      <description/>
      <files>
        <file category="header" name="components/i2c/i2c.h"/>
        <file category="sourceC" name="components/i2c/lpi2c_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.common_AND_driver.lpuart">
      <description/>
      <files>
        <file category="sourceC" name="components/uart/lpuart_adapter.c"/>
        <file category="header" name="components/uart/uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager" Cversion="1.0.0" condition="device.MIMXRT1064_AND_component.lists_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_manager.c"/>
        <file category="header" name="components/serial_manager/serial_manager.h"/>
        <file category="header" name="components/serial_manager/serial_port_internal.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.lpuart">
      <description/>
      <files>
        <file category="sourceC" name="components/serial_manager/serial_port_uart.c"/>
        <file category="header" name="components/serial_manager/serial_port_uart.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.1.0" condition="device.MIMXRT1064_AND_driver.codec_AND_driver.wm8960">
      <description/>
      <files>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_adapter.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MIMXRT1064_startup" Cversion="1.0.0" condition="device.MIMXRT1064_AND_CMSIS_Include_core_cm7">
      <description/>
      <files>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MIMXRT1064.s"/>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MIMXRT1064.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1064xxxxx_flexspi_nor.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1064xxxxx_flexspi_nor_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1064xxxxx_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1064xxxxx_sdram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MIMXRT1064xxxxx_sdram_txt.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1064xxxxx_flexspi_nor.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1064xxxxx_flexspi_nor_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1064xxxxx_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1064xxxxx_sdram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MIMXRT1064xxxxx_sdram_txt.icf"/>
        <file category="header" attr="config" name="MIMXRT1064.h"/>
        <file category="header" attr="config" name="MIMXRT1064_features.h"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="sourceC" attr="config" name="system_MIMXRT1064.c"/>
        <file category="header" attr="config" name="system_MIMXRT1064.h"/>
      </files>
    </component>
