mdhardenburgh/Blinky/Packages/.cache/NXP.MIMXRT1064_DFP.12.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pwm.c"/>
        <file category="header" name="drivers/fsl_pwm.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pxp" Cversion="2.0.1" condition="device.MIMXRT1064_AND_driver.common">
      <description>PXP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_pxp.c"/>
        <file category="header" name="drivers/fsl_pxp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>QTMR Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_qtmr.c"/>
        <file category="header" name="drivers/fsl_qtmr.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>RTWDOG Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_rtwdog.c"/>
        <file category="header" name="drivers/fsl_rtwdog.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.2.1" condition="device.MIMXRT1064_AND_driver.common">
      <description>SAI Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_sai.c"/>
        <file category="header" name="drivers/fsl_sai.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.2.0" condition="device.MIMXRT1064_AND_driver.edma_AND_driver.sai">
      <description>SAI Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_sai_edma.c"/>
        <file category="header" name="drivers/fsl_sai_edma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="semc" Cversion="2.0.4" condition="device.MIMXRT1064_AND_driver.common">
      <description>SEMC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_semc.c"/>
        <file category="header" name="drivers/fsl_semc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_hp" Cversion="2.1.2" condition="device.MIMXRT1064_AND_driver.common">
      <description>SNVS HP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_snvs_hp.c"/>
        <file category="header" name="drivers/fsl_snvs_hp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="snvs_lp" Cversion="2.1.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>SNVS LP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_snvs_lp.c"/>
        <file category="header" name="drivers/fsl_snvs_lp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif" Cversion="2.0.2" condition="device.MIMXRT1064_AND_driver.common">
      <description>SPDIF Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spdif.c"/>
        <file category="header" name="drivers/fsl_spdif.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif_edma" Cversion="2.0.0" condition="device.MIMXRT1064_AND_driver.edma_AND_driver.spdif">
      <description>SPDIF Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_spdif_edma.c"/>
        <file category="header" name="drivers/fsl_spdif_edma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="src" Cversion="2.0.1" condition="device.MIMXRT1064_AND_driver.common">
      <description>SRC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_src.c"/>
        <file category="header" name="drivers/fsl_src.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tempmon" Cversion="2.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>TEMPMON Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_tempmon.c"/>
        <file category="header" name="drivers/fsl_tempmon.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng" Cversion="2.0.4" condition="device.MIMXRT1064_AND_driver.common">
      <description>TRNG Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_trng.c"/>
        <file category="header" name="drivers/fsl_trng.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsc" Cversion="2.0.2" condition="device.MIMXRT1064_AND_driver.common">
      <description>TSC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_tsc.c"/>
        <file category="header" name="drivers/fsl_tsc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sdhc" Cversion="2.2.8" condition="device.MIMXRT1064_AND_driver.common">
      <description>USDHC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_usdhc.c"/>
        <file category="header" name="drivers/fsl_usdhc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-common" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/video/fsl_video_common.c"/>
        <file category="header" name="components/video/fsl_video_common.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c" Cversion="1.0.0" condition="device.MIMXRT1064_AND_driver.common">
      <description/>
      <files>
        <file category="sourceC" name="components/video/i2c/fsl_video_i2c.c"/>
        <file category="header" name="components/video/i2c/fsl_video_i2c.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wdog" Cversion="2.1.0" condition="device.MIMXRT1064_AND_driver.common">
      <description>wdog01 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_wdog.c"/>
        <file category="header" name="drivers/fsl_wdog.h"/>
      </files>
    </component>
